+++
title = "GitHub Pagesの利用を再開した"
date = "2019-01-06T02:31:18+09:00"
tags = ['Hugo']
+++

元々GitHub Pagesを使ってコンピュータ関連の技術系のブログ（所謂技術ブログ）を公開しようと
1年ぐらい前にやっていて、実際Jekyllで書けるようにするところまではやっていた。
が、特に何も書かずに放置してしまっていたので、整備し直すついでにHugoに乗り換えた。
（markdownのドキュメントをHugoでHTMLにして見るようにするということを業務でやっていて、
両方を触るのが面倒だったため）

大事なのは記事をちゃんと書くことで、今までは何か書くことが出来たらーという気持ちで
構えていたのが良くなかったなと思う。これ以上やることはないというぐらいに
やり尽くしたり学び尽くすなどという事は大体の事柄に対してあり得ないので、
やりきってから書くつもりだと中々その時が訪れない。
最低月1つは何か書くことにする。

また、調べたことをまとめて記事にすることも当初は考えていたが、いざとなると
「自分もネットで調べて知識を得ているのだから、まとめて書いたところで新規性も無いただの劣化コピーになるだけ」
と思ってしまい書く気にならなかった。
しかし、GitHub Pagesで書いてサクッと公開するぐらいならSEO的にもそんなに人目に触れないと思うので、
本当に私的なメモを（見ようと思えば）誰にでも見れる場所に置いているだけ、という気持ちで取り組もうと思う。

しょうもない事を長々書いたが、基本的には何かしら技術に関する話題を含む記事を今後定期的に書いていきたいと思う。
